//1 Запросить у пользователя число и определить, оно положительное, отрицательное или ноль.
// const num = prompt("Your number",'');
//
// if (num > 0){
//     alert('положительное')
// } else if (num < 0){
//     alert('отрицательное')
// } else {
//     alert('ноль')
// }

//2 Запросить у пользователя его возраст и проверить корректность введенных данных (0–120 лет).
// const num = prompt("Your number",'');
// if (num < 0){
//     alert('Упс. Слишком мало')
// }
// else if (num > 120 ){
//     alert('Упс. Слишком много')
// } else {
//     alert(`Поздравляю! Вам ${num}`)
// }

//3 Запросить у пользователя число и вывести его модуль (|7| = 7, |-7| = 7).

// const num = prompt("Your number",'');
//
// if (num >= 0){
//     alert(`|${num}|`)
// } else {
//     alert(`|${num * -1}|`)-
// }

//4 Запросить у пользователя время (часы, минуты, секунды) и проверить корректность введенных данных.

// const hour = +prompt('Hour','0');
// const min = +prompt('Min',0);
// const sec = +prompt('Sec',0);
//
// if (hour<=24){
//     alert('ok')
// } else {
//     alert('no')
// }
// if (min <=60){
//     alert('ok')
// } else {
//     alert('no')
// }
// if (sec <=60){
//     alert('ok')
// } else {
//     alert('no')
// }

//5 Запросить координаты точки (x, y) и определить номер четверти, в которую попала эта точка. Необходимо учесть случаи попадания точки на оси X или Y или в начало координат.

//6 Запросить у пользователя номер месяца и вывести на экран его название.

//7 Реализовать калькулятор. Пользователь вводит 2 числа и знак (+ - * /). В зависимости от введенного знака решить пример и вывести результат.

//8 Запросить 2 числа и вывести большее из них.


//9 Запросить 1 число и проверить, оно кратно 5 или нет.

//10 Запросить у пользователя название планеты. Если пользователь ввел «Земля» или «земля», то вывести «Привет, землянин!», в остальных случаях вывести «Привет, инопланетянин!».


